astro-build.astro-vscode
bradlc.vscode-tailwindcss
cha-theme.cha-theme
dbaeumer.vscode-eslint
denoland.vscode-deno
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
unifiedjs.vscode-mdx
yoavbls.pretty-ts-errors